# IFCAggregateIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregateIterator Class
Members See Also
---
A class used to iterate individual objects in an IFCAggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class IFCAggregateIterator : IEnumerator<IFCData>
```

Visual Basic
---
```text
Public Class IFCAggregateIterator _
	Implements IEnumerator(Of IFCData)
```

Visual C++
---
```text
public ref class IFCAggregateIterator : IEnumerator<IFCData^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCAggregateIterator
# See Also
IFCAggregateIterator Members
Autodesk.Revit.DB.IFC Namespace